main.floors.base_9=
{
    "floorId": "base_9",
    "title": "地下  9F",
    "name": "-9",
    "canFlyTo": true,
    "canUseQuickShop": true,
    "defaultGround": "ground",
    "images": [],
    "item_ratio": 4,
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1, 87,  0, 81,  0,  0,  0,  0,  0,224,  0, 32,  1],
    [  1,  0,  0,  1,  1,  1,  1,  1,  1,  1,  0,  0,  1],
    [  1, 82,  1,  1, 32, 31,  1, 21, 21,  1,  1,232,  1],
    [  1,  0,  1, 31, 32, 31,  1, 31, 32, 22,  1,  0,  1],
    [  1,  0,  1, 31, 31, 21,  1, 64, 31, 31,  1,  0,  1],
    [  1, 31,  1,  1,  1,  1,  1,  1,  1,  1,  1,389,  1],
    [  1,  0,  1, 21, 21, 23,  1, 28, 27, 27,  1,  0,  1],
    [  1,  0,  1, 21, 21, 31,  1, 28, 27, 28,  1,  0,  1],
    [  1,224,  1,  1, 21, 22,  1, 28, 27,  1,  1,232,  1],
    [  1,  0,  0,  1,  1,  1,  1,  1,  1,  1,  0,  0,  1],
    [  1,121,  0,389,  0,  0,  0,  0,  0,370,  0, 88,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "firstArrive": [],
    "events": {
        "1,11": [
            "\t[老人,man]水之宝石可以让你在水中自由移动。\n想要取得水之宝石，需要获得宝石镐。"
        ]
    },
    "changeFloor": {
        "1,1": {
            "floorId": "base_8",
            "stair": "downFloor"
        },
        "11,11": {
            "floorId": "base_10",
            "loc": [
                11,
                11
            ],
            "time": 500
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "width": 13,
    "height": 13,
    "autoEvent": {},
    "underGround": true,
    "bgmap": [

],
    "fgmap": [

]
}