main.floors.main4=
{
    "floorId": "main4",
    "title": "主塔  4F",
    "name": "4",
    "canFlyTo": true,
    "canUseQuickShop": true,
    "defaultGround": "ground",
    "images": [],
    "item_ratio": 1,
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1,122,  0,  0, 81,253, 21, 21, 27,  1, 21, 21,  1],
    [  1,  0,  0,  0,  1,  1,  1,  1,  1,  1, 21, 21,  1],
    [  1,  0,201,  0,  1, 28, 21, 21,205,  1,201,201,  1],
    [  1,  1, 81,  1,  1,  1,  1,  1, 81,  1, 81,  1,  1],
    [  1,  0,  0,  0,  1,  0,  0,  0,  0,  0,202,  0,  1],
    [  1, 88,  0,201, 81,  0,  1,  1,  1,  1,  1,  1,  1],
    [  1,  0,  0,  0,  1,  0,205,  0, 81,205, 21, 21,  1],
    [  1,  1,  1,  1,  1,  1, 81,  1,  1,  1, 81,  1,  1],
    [  1,202, 35,202,  1,  0,202,  0,  1,  0,210,  0,  1],
    [  1,  0,202,  0,  1,  0,  0,  0,  1, 31,  0, 21,  1],
    [  1, 88,  0,  0,  1,  0, 87,  0,  1,  0, 28,  0,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "firstArrive": [],
    "events": {
        "1,1": [
            "\t[商人,woman]三层的商店里有陷阱。"
        ]
    },
    "changeFloor": {
        "1,6": {
            "floorId": "main3",
            "loc": [
                1,
                6
            ]
        },
        "1,11": {
            "floorId": "main3",
            "loc": [
                1,
                11
            ]
        },
        "6,11": {
            "floorId": "main5",
            "stair": "downFloor"
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "downFloor": [
        1,
        6
    ],
    "width": 13,
    "height": 13,
    "autoEvent": {},
    "bgmap": [

],
    "fgmap": [

]
}