main.floors.MOTA2=
{
    "floorId": "MOTA2",
    "title": "魔塔  2F",
    "name": "0",
    "canFlyTo": false,
    "canUseQuickShop": true,
    "defaultGround": "ground",
    "images": [],
    "item_ratio": 1,
    "map": [
    [340,340,340,340,340,340,340,340,340,340,340,340,340],
    [340,340,340,340,340,  0, 90,  0,340,340,340,340,340],
    [340,340,340,340,340,  0,  0,  0,340,340,340,340,340],
    [340,340,340,  1,  1,  1,  0,  1,  1,  1,340,340,340],
    [340,340,340,  1,  0,  0,  0,  0,  0,  1,340,340,340],
    [340,  0,  0,  1,  0,  0,  0,  0,  0,  1,  0,  0,340],
    [340,  0,  0,  0,  0,  0,208,  0,  0,  0,  0,  0,340],
    [340,  0,  0,  1,  0,  0,  0,  0,  0,  1,  0,  0,340],
    [340,340,340,  1,  0,  0,  0,  0,  0,  1,340,340,340],
    [340,340,340,  1,  1,  1,  0,  1,  1,  1,340,340,340],
    [340,340,340,340,340,351,351,351,340,340,340,340,340],
    [340,340,340,340,340,351,351,351,340,340,340,340,340],
    [340,340,340,340,340,340,340,340,340,340,340,340,340]
],
    "firstArrive": [],
    "events": {
        "6,1": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": false,
            "data": []
        }
    },
    "changeFloor": {
        "6,1": {
            "floorId": "MOTA3",
            "loc": [
                6,
                11
            ],
            "time": 500
        }
    },
    "afterBattle": {
        "6,6": [
            "\t[吸血鬼,vampire]上帝啊 我做梦也没想到我会被别人打败 毫无疑问你是比我强 但以你现在的状态对于大法师来说又太弱了 你仅仅取得了一个暂时的胜利",
            {
                "type": "show",
                "loc": [
                    [
                        6,
                        1
                    ]
                ],
                "time": 500
            },
            {
                "type": "setValue",
                "name": "status:atk",
                "value": "flag:atkB5"
            },
            {
                "type": "setValue",
                "name": "status:def",
                "value": "flag:defB5"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "width": 13,
    "height": 13,
    "autoEvent": {},
    "bgmap": [

],
    "fgmap": [

]
}