main.floors.MOTA7=
{
    "floorId": "MOTA7",
    "title": "魔塔  7F",
    "name": "0",
    "canFlyTo": false,
    "canUseQuickShop": true,
    "defaultGround": "ground",
    "images": [],
    "item_ratio": 1,
    "map": [
    [  3,  3,  3,  3,  3, 17, 17, 17,  3,  3,  3,  3,  3],
    [  3, 28,  3,  3,  3,  3, 56,  3,  3,  3,  3,327,  3],
    [  3, 63,  3,  3,  3,  3, 63,  3,  3,  3,  3, 63,  3],
    [  3, 63,  3,  3,  3,  3, 63,  3,  3,  3,  3, 63,  3],
    [  3,  0,  3,  3,  3,  3,248,  3,  3,  3,  3,  0,  3],
    [  3, 82,  3,  3,  3,  3, 82,  3,  3,  3,  3, 82,  3],
    [  3,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  3],
    [  3, 82,  3,  3,  3,  3, 81,  3,  3,  3,  3, 82,  3],
    [  3,  0,  3,  3,  3,  3,  0,  3,  3,  3,  3,  0,  3],
    [  3,  0,  3,  3,  3,  3,  0,  3,  3,  3,  3,  0,  3],
    [  3,  0,  3,  3,  3,  3,  0,125,  3,  3,  3,  0,  3],
    [  3,  0,  0,  0, 27,  4, 93,  4, 29,  0,  0,  0,  3],
    [  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3]
],
    "firstArrive": null,
    "events": {
        "7,10": [
            "\t[作者提示]新版经典模式，新版极速模式下，白银史莱姆固伤1000，黄金史莱姆固伤4000"
        ]
    },
    "changeFloor": {
        "6,11": {
            "floorId": "base17",
            "loc": [
                11,
                11
            ]
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "width": 13,
    "height": 13,
    "autoEvent": {},
    "bgmap": [

],
    "fgmap": [

]
}