main.floors.phant_plus_2=
{
    "floorId": "phant_plus_2",
    "title": "幻境",
    "name": "2",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": false,
    "images": [],
    "item_ratio": 4,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,1": {
            "floorId": "phant_plus_5",
            "loc": [
                11,
                2
            ],
            "time": 500
        },
        "11,1": {
            "floorId": "phant_plus_3",
            "loc": [
                1,
                1
            ],
            "time": 500
        },
        "1,11": {
            "floorId": "phant_plus_7",
            "loc": [
                11,
                6
            ],
            "time": 500
        },
        "4,9": {
            "floorId": "phant_plus_1",
            "loc": [
                1,
                6
            ],
            "time": 500
        },
        "6,11": {
            "floorId": "phant_plus_10",
            "loc": [
                6,
                10
            ],
            "time": 500
        },
        "11,11": {
            "floorId": "phant_plus_6",
            "loc": [
                11,
                3
            ],
            "time": 500
        }
    },
    "afterBattle": {
        "6,2": [
            {
                "type": "if",
                "condition": "!core.hasFlag('sealMage2')",
                "true": [
                    {
                        "type": "setValue",
                        "name": "flag:sealMage2",
                        "value": "1"
                    },
                    {
                        "type": "addValue",
                        "name": "flag:sealBroken",
                        "value": "1"
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                9,
                                6
                            ]
                        ],
                        "floorId": "phant_plus_2",
                        "remove": true,
                        "time": 0
                    },
                    {
                        "type": "sleep",
                        "time": 600
                    },
                    {
                        "type": "if",
                        "condition": "flag:sealBroken>=9",
                        "true": [
                            {
                                "type": "tip",
                                "text": "幻境二层的封印彻底解开了！"
                            }
                        ],
                        "false": [
                            {
                                "type": "tip",
                                "text": "红衣大法师倒下了，幻境二层封印的光芒减弱了（${flag:sealBroken}/9）"
                            }
                        ]
                    }
                ],
                "false": []
            }
        ],
        "6,5": [
            {
                "type": "setValue",
                "name": "flag:steel_phant_plus_2",
                "value": "1"
            },
            {
                "type": "function",
                "function": "function(){\ncore.updateCheckBlock();\ncore.updateDamage();\n}"
            },
            {
                "type": "sleep",
                "time": 600
            },
            {
                "type": "tip",
                "text": "铁怪倒下了：这一层的领域消失，怪物也不再复活"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  4,340,  4,  4,340,  4,  4,  4,  4,340,  4,  4,  4],
    [  4,417,  0,  0,  0,  0,  0,  0,  0,  0,  0,416,  4],
    [340,  0,340,  4,340,  0,337,  0,  4,  4, 28,  0,  4],
    [  4,216,  4,  0,  0,  0,  0,  0,  0,  4,340,  0,  4],
    [  4,216,  4,  0,  4,  4,  0,  4,225, 31,  4,  0,  4],
    [340,  0,  4,212,212,  4,236,  4,  4,  4,340,  0,  4],
    [  4, 31,340,  4, 31,340,340,340,340, 11, 11,  0,  4],
    [  4,  0,340,  4,  4,  4,  4, 32,340, 11,  4,  0,340],
    [340,  0,  4,  4,  4,340,216,  0,  4, 11,340,  0,  4],
    [  4,212,340,  4,417,  0,  0,  4,  4, 11,  4,  0,  4],
    [  4,  0, 27,  4,340,  4,340,  4,  4, 11,340,  0,  4],
    [  4,414,  0,225, 31,340, 90, 11, 11, 11,340,415,  4],
    [340,  4,  4,  4,340,  4,  4,340,  4,  4,  4,  4,340]
],
    "bgmap": [
    [351,351,351,351,351,351,351,351,351,351,351,351,351],
    [351,351,351,351,351,351,351,351,351,351,351,351,351],
    [351,351,351,351,351,351,351,351,351,351,351,351,351],
    [351,351,351,351,351,351,351,351,351,351,351,351,351],
    [351,351,351,351,351,351,351,351,351,351,351,351,351],
    [351,351,351,351,351,351,351,351,351,351,351,351,351],
    [351,351,351,351,351,351,351,351,351,351,351,351,351],
    [351,351,351,351,351,351,351,351,351,351,351,351,351],
    [351,351,351,351,351,351,351,351,351,351,351,351,351],
    [351,351,351,351,351,351,351,351,351,351,351,351,351],
    [351,351,351,351,351,351,351,351,351,351,351,351,351],
    [351,351,351,351,351,351,351,351,351,351,351,351,351],
    [351,351,351,351,351,351,351,351,351,351,351,351,351]
],
    "fgmap": [

]
}